tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# TIFF library and utilities
brew "libtiff"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# Postgres C API library
brew "libpq"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# General-purpose scripting language
brew "php", restart_service: true
# Dependency Manager for PHP
brew "composer"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# BSD-style licensed readline alternative
brew "libedit"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Dependency manager that installs and runs Swift command-line tool packages
brew "mint"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Audio codec
brew "opus"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql@14"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Internet file retriever
brew "wget"
cask "font-hack-nerd-font"
cask "font-iosevka"
